In [5]:
import pandas as pd
import numpy as np

In [6]:
data = np.random.randn(4,3)

In [7]:
data

array([[ 1.15954886, -0.98578447,  0.00978522],
       [ 0.31062502,  1.6156915 , -0.36537748],
       [-1.4867171 ,  1.06946547, -1.47711444],
       [-0.9904984 ,  0.2672383 ,  0.19184943]])

In [8]:
data_frame = pd.DataFrame(data)

In [9]:
data_frame

          0         1         2
0  1.159549 -0.985784  0.009785
1  0.310625  1.615692 -0.365377
2 -1.486717  1.069465 -1.477114
3 -0.990498  0.267238  0.191849

In [10]:
# DataFrame birden fala serinin birleşimi ve her sütun bir seridir. Dikka edersen sadece etiket label'ları yok
# Bunları excel toblosu olarakta karşımıza çıkartır

### DataFrame Nedir?

- **DataFrame**, iki boyutlu, etiketli bir veri yapısıdır. Tablo benzeri bir yapıya sahiptir ve satırlar ile sütunlardan oluşur. 

- **Satırlar** ve **sütunlar** hem adlara (etiketlere) hem de dizinlere (index) sahip olabilir.
- DataFrame, aynı anda çeşitli veri türlerini (string, integer, float, vb.) barındırabilir.

In [11]:
data_frame[0]

0    1.159549
1    0.310625
2   -1.486717
3   -0.990498
Name: 0, dtype: float64

In [12]:
# 0. index'i istediğimizde de bizim karşımıza bir seriyi çıkartıyor

# DataFrame Satır ve Sutün İsimlendirme

In [13]:
yeni_data_Frame = pd.DataFrame(data, index=["Atil", "Zeynep", "Atlas", "Mehmet"], columns = ["Maas", "Yas", "Calisma Saaati"])

In [14]:
yeni_data_Frame

            Maas       Yas  Calisma Saaati
Atil    1.159549 -0.985784        0.009785
Zeynep  0.310625  1.615692       -0.365377
Atlas  -1.486717  1.069465       -1.477114
Mehmet -0.990498  0.267238        0.191849

In [15]:
## Gördüğün gibi elimizde data'yı net bir şekilde gösteren bir tablo oluşturtuk

In [16]:
yeni_data_Frame["Yas"]

Atil     -0.985784
Zeynep    1.615692
Atlas     1.069465
Mehmet    0.267238
Name: Yas, dtype: float64

In [17]:
yeni_data_Frame["Maas"]

Atil      1.159549
Zeynep    0.310625
Atlas    -1.486717
Mehmet   -0.990498
Name: Maas, dtype: float64

In [18]:
## Gördüğün gi serinin column ismi ile istediğin seriyi elde edebiliyorsun

In [19]:
yeni_data_Frame[["Calisma Saaati", "Maas"]]

        Calisma Saaati      Maas
Atil          0.009785  1.159549
Zeynep       -0.365377  0.310625
Atlas        -1.477114 -1.486717
Mehmet        0.191849 -0.990498

In [20]:
## [liste] bir liste ile birden fazla seri'ide taablo şeklinde gösterebilirsin

# DataFrame 'de satır bilgisi alma

In [21]:
yeni_data_Frame.loc["Atil"]

Maas              1.159549
Yas              -0.985784
Calisma Saaati    0.009785
Name: Atil, dtype: float64

In [22]:
yeni_data_Frame.iloc[1]

Maas              0.310625
Yas               1.615692
Calisma Saaati   -0.365377
Name: Zeynep, dtype: float64

In [23]:
# loc[] ile bir dataFrame 'de satır bilgisine ulacabilirsi loc = located
# iloc ile de index bilgisi ile calumn bilgisini alabiliyoruz iloc= index located

## DataFrame' e Bir Seri Ekleme

In [24]:
yeni_data_Frame["Emeklilik Yasi"] = yeni_data_Frame["Yas"] +  yeni_data_Frame["Yas"]

In [25]:
yeni_data_Frame

            Maas       Yas  Calisma Saaati  Emeklilik Yasi
Atil    1.159549 -0.985784        0.009785       -1.971569
Zeynep  0.310625  1.615692       -0.365377        3.231383
Atlas  -1.486717  1.069465       -1.477114        2.138931
Mehmet -0.990498  0.267238        0.191849        0.534477

In [26]:
# Bu şekilde DataFrame 'e sutün eklemesi yapabilirsin

# DataFrame Satır veya Sutün Silme

In [27]:
yeni_data_Frame.drop("Emeklilik Yasi", axis= 1)

            Maas       Yas  Calisma Saaati
Atil    1.159549 -0.985784        0.009785
Zeynep  0.310625  1.615692       -0.365377
Atlas  -1.486717  1.069465       -1.477114
Mehmet -0.990498  0.267238        0.191849

In [28]:
yeni_data_Frame.drop("Atil", axis= 0)

            Maas       Yas  Calisma Saaati  Emeklilik Yasi
Zeynep  0.310625  1.615692       -0.365377        3.231383
Atlas  -1.486717  1.069465       -1.477114        2.138931
Mehmet -0.990498  0.267238        0.191849        0.534477

In [29]:
## axis = 0 (satır) ve  axis = 1 (sütun) drop ile satır yada sutün'ü silebilirsin

In [30]:
 yeni_data_Frame

            Maas       Yas  Calisma Saaati  Emeklilik Yasi
Atil    1.159549 -0.985784        0.009785       -1.971569
Zeynep  0.310625  1.615692       -0.365377        3.231383
Atlas  -1.486717  1.069465       -1.477114        2.138931
Mehmet -0.990498  0.267238        0.191849        0.534477

In [31]:
## Drop() özellikle belirtmezseniz orjinal veride değişiklik yapmıyor

In [32]:
yeni_data_Frame.drop("Emeklilik Yasi", axis = 1, inplace = True)

In [33]:
yeni_data_Frame

            Maas       Yas  Calisma Saaati
Atil    1.159549 -0.985784        0.009785
Zeynep  0.310625  1.615692       -0.365377
Atlas  -1.486717  1.069465       -1.477114
Mehmet -0.990498  0.267238        0.191849

In [34]:
### inplace = True ile orgnal veride kalıcı olarak veri değişikliği yapabiyoruz
### Yani, yeni_data_Frame deki Emeklilik Yasi serisini silebiliyoruz

In [35]:
yeni_data_Frame.loc["Atil"]

Maas              1.159549
Yas              -0.985784
Calisma Saaati    0.009785
Name: Atil, dtype: float64

In [36]:
yeni_data_Frame.loc["Atil"]["Yas"]

-0.9857844686818641

In [37]:
yeni_data_Frame.loc["Atil", "Yas"]

-0.9857844686818641

In [38]:
### Gördüğün gibi satır bilgisine bu şekilde ulaşabiliyorsun

In [39]:
yeni_data_Frame

            Maas       Yas  Calisma Saaati
Atil    1.159549 -0.985784        0.009785
Zeynep  0.310625  1.615692       -0.365377
Atlas  -1.486717  1.069465       -1.477114
Mehmet -0.990498  0.267238        0.191849

In [40]:
boolean = yeni_data_Frame < 0

In [41]:
boolean

         Maas    Yas  Calisma Saaati
Atil    False   True           False
Zeynep  False  False            True
Atlas    True  False            True
Mehmet   True  False           False

In [42]:
yeni_data_Frame[boolean]

            Maas       Yas  Calisma Saaati
Atil         NaN -0.985784             NaN
Zeynep       NaN       NaN       -0.365377
Atlas  -1.486717       NaN       -1.477114
Mehmet -0.990498       NaN             NaN

In [43]:
# Gördüğün gibi sadece sıfırdan küçük değerleri görüntülüyor olmayanları ise NaN şeklinde görüntülüyor

In [44]:
yeni_data_Frame[yeni_data_Frame < 0]

            Maas       Yas  Calisma Saaati
Atil         NaN -0.985784             NaN
Zeynep       NaN       NaN       -0.365377
Atlas  -1.486717       NaN       -1.477114
Mehmet -0.990498       NaN             NaN

In [45]:
# Bu şekilde de istediğimizi elde edebiliyorruz

In [46]:
yeni_data_Frame[yeni_data_Frame["Yas"] > 0]

            Maas       Yas  Calisma Saaati
Zeynep  0.310625  1.615692       -0.365377
Atlas  -1.486717  1.069465       -1.477114
Mehmet -0.990498  0.267238        0.191849

In [47]:
### Burada, yeni_data_Frame["Yas"] > 0 ile sadece pozitif değerleri karşına çıkartıyor 
### Gördüğün gibi, negatif olan sutünları karşımıza çıkartıyor pozitif olanaları ise siliyor

In [48]:
yeni_data_Frame[yeni_data_Frame["Calisma Saaati"] > 0]

            Maas       Yas  Calisma Saaati
Atil    1.159549 -0.985784        0.009785
Mehmet -0.990498  0.267238        0.191849

In [49]:
# Sacece pozitif olan Çalışma Saati değerlerini karşımıza çıkartıyor

# DataFrame İndex Değiştirme / Organize Etme

In [50]:
index = np.random.randn(5,6)

In [51]:
index_dataframe = pd.DataFrame(data = index, index=["Sumeyra", "Melinda", "Lale", "Lila", "Onur"], columns = ["Sınav1", "Sınav2", "Sınav3", "Sınav4", "Sınav5", "NotOrtalaması"])

In [52]:
index_dataframe

           Sınav1    Sınav2    Sınav3    Sınav4    Sınav5  NotOrtalaması
Sumeyra  0.081451  0.321592  0.879080  0.227991 -0.491279      -1.681653
Melinda -1.739263 -0.068861 -1.092672 -0.053195 -0.373378      -0.653061
Lale    -0.227575  0.544027  1.688569  0.984046 -0.514877       0.094745
Lila     0.823813 -1.293035  0.484873 -0.655469  0.296417      -0.581882
Onur    -0.197844 -0.832831  0.236901  0.055327 -0.141087       0.928222

In [53]:
index_dataframe.reset_index()

     index    Sınav1    Sınav2    Sınav3    Sınav4    Sınav5  NotOrtalaması
0  Sumeyra  0.081451  0.321592  0.879080  0.227991 -0.491279      -1.681653
1  Melinda -1.739263 -0.068861 -1.092672 -0.053195 -0.373378      -0.653061
2     Lale -0.227575  0.544027  1.688569  0.984046 -0.514877       0.094745
3     Lila  0.823813 -1.293035  0.484873 -0.655469  0.296417      -0.581882
4     Onur -0.197844 -0.832831  0.236901  0.055327 -0.141087       0.928222

DataFrame.reset_index() fonksiyonu, bir Pandas DataFrame'in indeksini sıfırlamak için kullanılır.
- reset_index() fonksiyonu, DataFrame'in indeksini sıfırlar ve varsayılan olarak eski indeksleri bir sütun olarak tutar.
- Eğer eski indeksleri tamamen atmak isterseniz, şu şekilde kullanabilirsiniz: df.reset_index(drop=True).

In [54]:
index_dataframe.reset_index(drop = True )

     Sınav1    Sınav2    Sınav3    Sınav4    Sınav5  NotOrtalaması
0  0.081451  0.321592  0.879080  0.227991 -0.491279      -1.681653
1 -1.739263 -0.068861 -1.092672 -0.053195 -0.373378      -0.653061
2 -0.227575  0.544027  1.688569  0.984046 -0.514877       0.094745
3  0.823813 -1.293035  0.484873 -0.655469  0.296417      -0.581882
4 -0.197844 -0.832831  0.236901  0.055327 -0.141087       0.928222

In [55]:
# drop = True sayesinde eski değerleri 0,1.. şeklinde sayılarla tutarken drop methodu
# ile eski değerleri tamammen siler bu şekilde

In [56]:
index_dataframe

           Sınav1    Sınav2    Sınav3    Sınav4    Sınav5  NotOrtalaması
Sumeyra  0.081451  0.321592  0.879080  0.227991 -0.491279      -1.681653
Melinda -1.739263 -0.068861 -1.092672 -0.053195 -0.373378      -0.653061
Lale    -0.227575  0.544027  1.688569  0.984046 -0.514877       0.094745
Lila     0.823813 -1.293035  0.484873 -0.655469  0.296417      -0.581882
Onur    -0.197844 -0.832831  0.236901  0.055327 -0.141087       0.928222

In [57]:
## Gördüğün gibi orjinal veriyi kalıcı olarak değiştirmez

## Kalıcı olarak DataFrame'de Değişiklik Yapma:

In [58]:
yeni_index_listesi = ["Sum", "Meli", "la", "li", "On"]

In [59]:
## Öncelikle belirleyeceğin değerleri bir değişkene ata

In [60]:
index_dataframe["Yeni İndex"] = yeni_index_listesi

In [61]:
index_dataframe

,Sınav1,Sınav2,Sınav3,Sınav4,Sınav5,NotOrtalaması,Yeni İndex
Sumeyra,0.081451,0.321592,0.879080,0.227991,-0.491279,-1.681653,Sum
Melinda,-1.739263,-0.068861,-1.092672,-0.053195,-0.373378,-0.653061,Meli
Lale,-0.227575,0.544027,1.688569,0.984046,-0.514877,0.094745,la
Lila,0.823813,-1.293035,0.484873,-0.655469,0.296417,-0.581882,li
Onur,-0.197844,-0.832831,0.236901,0.055327,-0.141087,0.928222,On

In [62]:
## Sonra dataFrame' e yeni index'imizi bir seri gibi ekliyoruz

In [63]:
index_dataframe.set_index("Yeni İndex")

              Sınav1    Sınav2    Sınav3    Sınav4    Sınav5  NotOrtalaması
Yeni İndex
Sum         0.081451  0.321592  0.879080  0.227991 -0.491279      -1.681653
Meli       -1.739263 -0.068861 -1.092672 -0.053195 -0.373378      -0.653061
la         -0.227575  0.544027  1.688569  0.984046 -0.514877       0.094745
li          0.823813 -1.293035  0.484873 -0.655469  0.296417      -0.581882
On         -0.197844 -0.832831  0.236901  0.055327 -0.141087       0.928222

In [64]:
# En son, set_index() ile eski index değerleri değiştiriyoruz.

In [65]:
index_dataframe

,Sınav1,Sınav2,Sınav3,Sınav4,Sınav5,NotOrtalaması,Yeni İndex
Sumeyra,0.081451,0.321592,0.879080,0.227991,-0.491279,-1.681653,Sum
Melinda,-1.739263,-0.068861,-1.092672,-0.053195,-0.373378,-0.653061,Meli
Lale,-0.227575,0.544027,1.688569,0.984046,-0.514877,0.094745,la
Lila,0.823813,-1.293035,0.484873,-0.655469,0.296417,-0.581882,li
Onur,-0.197844,-0.832831,0.236901,0.055327,-0.141087,0.928222,On

In [66]:
## Fakat burada da orginal veride değişiklik yapıldı

In [67]:
index_dataframe.set_index("Yeni İndex", inplace = True)

In [68]:
index_dataframe

              Sınav1    Sınav2    Sınav3    Sınav4    Sınav5  NotOrtalaması
Yeni İndex
Sum         0.081451  0.321592  0.879080  0.227991 -0.491279      -1.681653
Meli       -1.739263 -0.068861 -1.092672 -0.053195 -0.373378      -0.653061
la         -0.227575  0.544027  1.688569  0.984046 -0.514877       0.094745
li          0.823813 -1.293035  0.484873 -0.655469  0.296417      -0.581882
On         -0.197844 -0.832831  0.236901  0.055327 -0.141087       0.928222

In [69]:
## inplace = True ile orginal veride kalıcı olarak değişiklik yapabiliyoruz

In [70]:
index_dataframe.loc["Sum"]

Sınav1           0.081451
Sınav2           0.321592
Sınav3           0.879080
Sınav4           0.227991
Sınav5          -0.491279
NotOrtalaması   -1.681653
Name: Sum, dtype: float64

In [71]:
## Gördüğün gibide çalışıyor ve satırı alabiliyorsun

In [72]:
ilkIndexler = ["Simpson", "Simpson", "Simpson", "South Park", "South Park", "South Park"]

In [73]:
icindekiler = ["Homer", "Bart", "Marge", "Cartman", "Kenny", "Kyle"]

In [74]:
birlesmis_index = list(zip(ilkIndexler, icindekiler))

In [75]:
birlesmis_index

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

## zip() Fonksiyonu Nedir?

`zip()` fonksiyonu, birden fazla listeyi ya da **iterable** (iterasyon yapılabilen veri tipleri, örneğin `tuple` veya `set` gibi) veri tipini bir araya getirir ve her listedeki aynı indeksteki elemanları eşleştirerek bir `tuple` oluşturur. Bu `tuple`ları içeren bir **zip objesi** döner. Eğer bunu listeye çevirmek isterseniz `list()` fonksiyonunu kullanırsınız.

In [77]:
birlesmis_indexs = pd.MultiIndex.from_tuples(birlesmis_index)

In [78]:
birlesmis_indexs

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )


`pd.MultiIndex.from_tuples()` kullanarak tuple listesini çok seviyeli bir indekse dönüştürmek, veriyi daha hiyerarşik ve organize bir şekilde yapılandırmamıza olanak sağlar. Bu, özellikle karmaşık veri kümesi ve analizi gerektiren durumlarda çok faydalıdır.

In [82]:
benim_cizgifilm_listem = [[40, "A"],[10, "B"],[30, "C"],[9, "D"],[10, "E"],[11, "F"]]

In [90]:
cizgifilm_numpy_dizisi = np.array(benim_cizgifilm_listem)

In [93]:
cizgifilm_dataframe = pd.DataFrame(cizgifilm_numpy_dizisi, index = birlesmis_indexs, columns= ["Yas", "Meslek"])

In [89]:
cizgifilm_dataframe

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [94]:
# Gördüğün gibi verileri daha organize Yaptık

In [96]:
cizgifilm_dataframe.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [97]:
cizgifilm_dataframe.loc["South Park"]

        Yas Meslek
Cartman   9      D
Kenny    10      E
Kyle     11      F

In [99]:
 cizgifilm_dataframe.loc["Simpson"].loc["Homer"]

Yas       40
Meslek     A
Name: Homer, dtype: object

In [102]:
## Gördüğün gibi Multi index taplolarıda oluşturabiliyoruz ve diğer DataFrame 'de satır bilgilerine nasıl ulaşıyorsak aynı şekilde
## Multi index DataFramede de yapabiliyoruz

In [103]:
cizgifilm_dataframe.index.names = ["Film_Adı", "İsim"]

In [104]:
cizgifilm_dataframe

                   Yas Meslek
Film_Adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [105]:
## Burada da isim verme işlemi yapabiliyoruz